In [1]:
import numpy as np

In [21]:
H = [1.45, 1.56, 1.47, 1.53, 1.62]
W = [45, 50, 41, 56, 62]

TypeError: can't multiply sequence by non-int of type 'list'

In [27]:
H_np = np.array(H)
W_np = np.array(W)

In [31]:
IBM = np.array(H_np*W_np)
IBM

array([ 65.25,  78.  ,  60.27,  85.68, 100.44])

In [45]:
Numbers = np.array([[3],[4]])
Numbers

array([[3],
       [4]])

In [47]:
Numbers2 = np.array([3,4])
Numbers2

array([3, 4])

In [57]:
numbers3 = np.array([[1,2], [2,8], [7,3]])
numbers3

array([[1, 2],
       [2, 8],
       [7, 3]])

In [74]:
x = np.array([[4,5,6],
              [7,8,2],
              [3,7,8]])
y = np.array([
    [1,2,3,1],
    [2,0,3,3],
    [0,4,1,1]
])
dd = np.dot(x,y)

In [76]:
dd

array([[14, 32, 33, 25],
       [23, 22, 47, 33],
       [17, 38, 38, 32]])

In [86]:
dd.sort(axis =1)
dd

array([[14, 23, 32, 33],
       [17, 25, 33, 38],
       [22, 32, 38, 47]])

<div> 
<h1> Dictionary </h1>
</div>

In [100]:
word = {"Russia" : 302, "India": 500, "UK": 20, "US":200, "SK": 40}

In [102]:
word

{'Russia': 302, 'India': 500, 'UK': 20, 'US': 200, 'SK': 40}

In [104]:
word["Russia"]

302

In [106]:
new_country = {"Turkey":90}
word.update(new_country)

In [108]:
word

{'Russia': 302, 'India': 500, 'UK': 20, 'US': 200, 'SK': 40, 'Turkey': 90}

<div> 
<h1> DataFrame </h1>
</div>

In [120]:
import pandas as pd

In [124]:
ooo = {
    "country": ["iran", "US","UK","india"],
    "capital":["Tehran", "NY","london", "dehly"],
    "continent":["asia","america","europ","asia"],
    "population":[80,300,60,1000]
}
ooo

{'country': ['iran', 'US', 'UK', 'india'],
 'capital': ['Tehran', 'NY', 'london', 'dehly'],
 'continent': ['asia', 'america', 'europ', 'asia'],
 'population': [80, 300, 60, 1000]}

In [126]:
brics = pd.DataFrame(ooo)

In [128]:
brics

  country capital continent  population
0    iran  Tehran      asia          80
1      US      NY   america         300
2      UK  london     europ          60
3   india   dehly      asia        1000

In [141]:
brics.shape[0]

4

In [143]:
list2 = np.array([[1,2,3,4,5],
                 [4,5,6,7,7],
                 [1,0,2,3,1],
                 [4,7,8,2,1],
                 [5,8,0,1,2,]
                 ])

In [149]:
my_df = pd.DataFrame(list2,
                    index = ["part1","part2","part3","part4","part5"],
                    columns = ["Tehran", "Shiraz", "Isfahan", "Yazd", "Tabriz"])
my_df

       Tehran  Shiraz  Isfahan  Yazd  Tabriz
part1       1       2        3     4       5
part2       4       5        6     7       7
part3       1       0        2     3       1
part4       4       7        8     2       1
part5       5       8        0     1       2

In [162]:
file2 = pd.read_csv(r"C:\Users\Mahsa\minidata.csv")

In [166]:
file2.head()

      name      breed  color  height  weight date of birth
0    bella   Labrador  brown      56      24    2013-07-01
1  charlie     poodle  black      43      24    2016-09-16
2     lucy  chow chow  brown      46      24    2014-08-25
3   cooper  schnauzer   gray      49      17    2011-12-11
4      max   Labrador  black      59      29    2017-01-20

In [185]:
file2[["name"]]

      name
0    bella
1  charlie
2     lucy
3   cooper
4      max
5   stella
6   bernie

In [189]:
file2[["name", "color"]]

      name  color
0    bella  brown
1  charlie  black
2     lucy  brown
3   cooper   gray
4      max  black
5   stella    Tan
6   bernie  white

In [193]:
file2.iloc[[3]]

     name      breed color  height  weight date of birth
3  cooper  schnauzer  gray      49      17    2011-12-11

In [195]:
file2.iloc[[3],[2]]

  color
3  gray

In [197]:
file2.describe()

          height     weight
count   7.000000   7.000000
mean   49.714286  27.714286
std    17.960274  22.216468
min    18.000000   2.000000
25%    44.500000  20.500000
50%    49.000000  24.000000
75%    57.500000  26.500000
max    77.000000  74.000000